Revit 2027 API
ParameterTypeId.InstanceFreeHostParam Property
 "Host": Deprecated. Replaced by INSTANCE_FREE_HOST_ID
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId InstanceFreeHostParam { get; }
Public Shared ReadOnly Property InstanceFreeHostParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ InstanceFreeHostParam {
	ForgeTypeId^ get ();
}
static member InstanceFreeHostParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace